<script>
  export default {
    data() {
      return {
        // Вопрос-ответ
        faqList: [
          {
            question: 'Сильно портит волосы?',
            answer: `В плетении свои волосы находятся в покое, и с ними ничего не происходит. 
            Они отдыхают от воздействия фена, утюжков и плоек, что только в пользу.
            Если волосы убиты окрашиваниями и обесцвечиванием, то рекомендуем сократить срок носки
            прически и делать перерывы в плетении на питательные/увлажняющие маски.`,
          },
          {
            question: 'Как мыть голову?',
            answer: `Примерно раз в 7 дней. Развести свой привычный шампунь с водой в шейкере с носиком
            или взять и вспенить чистую губку для мытья посуды. Мыть нужно только кожу головы стоя в душе,
            голову лучше не запрокидывать вперёд. Мылить косы/дреды/кудри не надо, стекающей пены им достаточно.
            Выйдя из душа прическу нажно слегка отжать полотенцем. С кос/дредов/кудрей воды быстро скатывается,
            т.к. они её не впитывают. А свои волосы сохнут подольше, поэтому мыть голову лучше с утра, чтобы не 
            спать с влажной головой (может запреть и появиться не приятный запах).`,
          },
          {
            question: 'Вши заведутся?',
            answer: `Наличие кос/дредов/кудрей никак на это не влияет.
            Вшей можно подцепить только контактируя с людьми, у которых они есть.`,
          },
          {
            question: 'Потом стричься налысо?',
            answer: `Раньше это касалось только натуральных дредов из своих волос.
            Их действительно срезали, когда причёска надоедала (некоторые и сейчас так делают).
            Но современные техники плетения позволяют расплести натуральные дреды и сохранить волосы.
            Все остальные прически (косы/дреды/кудри) расплетаются без труда при соблюдении наших рекомендаций.`,
          },
          {
            question: 'На короткие волосы получится?',
            answer: `Для заплетения длина волос должна быть от 10см. Возможно заплести на
            длинну от 5см, но с большой вероятностью прическа будет плохо держаться,
            и на долго её не хватит.`,
          },
          {
            question: 'Как долго плести?',
            answer: `Косы/дреды (2-4 часа), кудри на каркас (4-6 часов), зизи (3-6 часов),
            точечные классические косы (от 6 часов до нескольких дней, зависит от кол-ва кос),
            брейды в хвост (2-4 часа), две боксёрские косы (1.5-2 часа), водопад (1-2 часа),
            время примерное т.к зависит от длины/густоты волос и сложности прически.`,
          },
          {
            question: 'Сильно тяжело во весу?',
            answer: `Максимальный допустимый вес на голову, выявленный трихологами 600гр.
            Мы делаем облегчённые комплекты кос/дредов со средним весом 350гр., а комлекты кудрей 300гр.
            Так же в учёт берём густоту волос клиента.`,
          },
          {
            question: 'Будет больно?',
            answer: `Во время плетения и адаптационного периода будет чувство стянутости. Мы плетём
            не больно, но чувствительность кожи у всех разная. Если ощущаете во время плетения дискомфорт -
            сразу говорите мастеру.`,
          },
          {
            question: 'Можно ли перекрасить косы/кудри, если цвет надоел?',
            answer: `К сожалению нет. Канекалон не поддаётся окрашиванию, даже немного. Поэтому к
            выбору цвета стоит подойти ответственно. Если вы хотите максимально точного попадания в цвет, лучше придти
            к нам в студию на личную консультацию.`,
          },
          {
            question: 'Со скольки лет можно детям?',
            answer: `Плетём детей от 5ти лет, если у них уже хорошей густоты окрепшие волосы.
            делаем всегда максимально лёгкие прически. Так же важно, чтобы ребёнок был усидчивым,
            ведь плетение занимает не мало времени.`,
          },
          {
            question: 'А сегодня/завтра можно?',
            answer: `В редких случая - да, если вы хотите комплект/кудри из наличия и при наличии у нас
            свободного окна. Если нужно изготавливать комплект кос/дредов или заказывать нужный материал, то
            запись осуществляется через 4-7 дней. В летние месяцы повышенный спрос, и записываться лучше
            за 1,5 - 2 недели.`,
          },
        ],
      }
    },
    methods: {
      // Открытие/закрытие ответа на вопрос
      openAnswer(question) {
        const doc = document.querySelectorAll('.faq__answer');
        this.faqList.forEach((q, i) => {
          if(question === q.question) {
            doc[i].classList.toggle('faq__answer--open');
          }
        });
      },
    },
  }
</script>

<template>
  <section class="faq">
    <div class="container">
      <h2 class="faq__title">Ещё сомневаешься? Прочти!</h2>
      <ul class="faq__info-list">
        <li class="faq__info-item"
            v-for="li in faqList"
            v-bind:key="li">
          <h3 class="faq__question"
              v-on:click="openAnswer(li.question)">{{ li.question }}</h3>
          <p class="faq__answer">{{ li.answer }}</p>
        </li>
      </ul>
    </div>
  </section>
</template>